Revit 2026 API

# RebarDeformationType Enumeration

---

Bar deformation type

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarDeformationType
```
```vb
Public Enumeration RebarDeformationType
```
```cpp
public enum class RebarDeformationType
```
```fsharp
type RebarDeformationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Deformed | 0 | The bar is ribbed. |
| Plain | 1 | The bar is not ribbed. |

#### Reference

Autodesk.Revit.DB.Structure Namespace